using Tyuiu.LavrentevVA.Sprint2.Task3.V11.Lib;

using System;
using System.Collections.Generic;
using System.Linq;
using System.Runtime.ConstrainedExecution;
using System.Text;

namespace Tyuiu.LavrentevVA.Sprint2.Task3.V11
{
    internal class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Сприт #1 | Выполнил: Лаврентьев В. А. | ИСПБ-25-1";
            Console.WriteLine("***********************************************************************************************************************************************************************************************************************************************");
            Console.WriteLine("* Спринт #2                                                                                                                                                                                                                                   *");
            Console.WriteLine("* Тема: Базовые навыки работы в C#                                                                                                                                                                                                            *");
            Console.WriteLine("* Задание #3                                                                                                                                                                                                                                  *");
            Console.WriteLine("* Вариант #11                                                                                                                                                                                                                                *");
            Console.WriteLine("* Выполнил: Лаврентьев В. А. | ИСПБ-25-1                                                                                                                                                                                                      *");
            Console.WriteLine("***********************************************************************************************************************************************************************************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                                                                                                                                                                                    *");
            Console.WriteLine("* Написать программу, которая вычисляет требуемое значение функции Y с использованием вложенных оператор if-else,                                                                                                                             *");
            Console.WriteLine("* где пользователь вводит значение переменной X с клавиатуры. Округлить полученное значение до трех знаков после запятой;                                                                                                                     *");
            Console.WriteLine("***********************************************************************************************************************************************************************************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                                                                                                                                                            *");
            Console.WriteLine("*                                                                                                                                                                                                                                             *");
            Console.WriteLine("***********************************************************************************************************************************************************************************************************************************************");

            Console.WriteLine(" Введите значение переменной X: ");
            double x  = Convert.ToDouble(Console.ReadLine());

            double res = ds.Calculate(x);

            Console.WriteLine("*********************************************************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                                        *");
            Console.WriteLine("*********************************************************************************************************************");


            Console.WriteLine(" Значение функции = : " + res);
        

            Console.ReadKey();

        }
    }
}
